zephyrproject-rtos/hal_microchip/pic32c/pic32cm_jh/pic32cm_jh00/atdf/PIC32CM6408JH00032.atdf
        <register name="WRCONFIG" offset="0x28" rw="W" size="4" access-size="4" initval="0x00000000" caption="Write Configuration">
          <bitfield name="PINMASK" caption="Pin Mask for Multiple Pin Configuration" mask="0xFFFF"/>
          <bitfield name="PMUXEN" caption="Select Peripheral Multiplexer" mask="0x10000"/>
          <bitfield name="INEN" caption="Input Enable" mask="0x20000"/>
          <bitfield name="PULLEN" caption="Pull Enable" mask="0x40000"/>
          <bitfield name="DRVSTR" caption="Output Driver Strength Selection" mask="0x400000"/>
          <bitfield name="PMUX" caption="Peripheral Multiplexing Template" mask="0xF000000"/>
          <bitfield name="WRPMUX" caption="Write PMUX Registers" mask="0x10000000"/>
          <bitfield name="WRPINCFG" caption="Write PINCFG Registers" mask="0x40000000"/>
          <bitfield name="HWSEL" caption="Half-Word Select" mask="0x80000000"/>
        </register>
        <register name="EVCTRL" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="Event Input Control">
          <bitfield name="PID0" caption="Port Event Pin Identifier 0" mask="0x1F"/>
          <bitfield name="EVACT0" caption="Port Event Action 0" mask="0x60" values="PORT_EVCTRL__EVACT0"/>
          <bitfield name="PORTEI0" caption="Port Event Enable Input 0" mask="0x80"/>
          <bitfield name="PID1" caption="Port Event Pin Identifier 1" mask="0x1F00"/>
          <bitfield name="EVACT1" caption="Port Event Action 1" mask="0x6000"/>
          <bitfield name="PORTEI1" caption="Port Event Enable Input 1" mask="0x8000"/>
          <bitfield name="PID2" caption="Port Event Pin Identifier 2" mask="0x1F0000"/>
          <bitfield name="EVACT2" caption="Port Event Action 2" mask="0x600000"/>
          <bitfield name="PORTEI2" caption="Port Event Enable Input 2" mask="0x800000"/>
          <bitfield name="PID3" caption="Port Event Pin Identifier 3" mask="0x1F000000"/>
          <bitfield name="EVACT3" caption="Port Event Action 3" mask="0x60000000"/>
          <bitfield name="PORTEI3" caption="Port Event Enable Input 3" mask="0x80000000"/>
        </register>
        <register name="PMUX" offset="0x30" rw="RW" size="1" count="16" initval="0x00" caption="Peripheral Multiplexing n">
          <bitfield name="PMUXE" caption="Peripheral Multiplexing for Even-Numbered Pin" mask="0xF" values="PORT_PMUX__PMUXE"/>
          <bitfield name="PMUXO" caption="Peripheral Multiplexing for Odd-Numbered Pin" mask="0xF0" values="PORT_PMUX__PMUXO"/>
        </register>
        <register name="PINCFG" offset="0x40" rw="RW" size="1" count="32" initval="0x00" caption="Pin Configuration n">
          <bitfield name="PMUXEN" caption="Select Peripheral Multiplexer" mask="0x1"/>
          <bitfield name="INEN" caption="Input Enable" mask="0x2"/>
          <bitfield name="PULLEN" caption="Pull Enable" mask="0x4"/>
          <bitfield name="DRVSTR" caption="Output Driver Strength Selection" mask="0x40"/>
        </register>
      </register-group>
      <register-group name="PORT" caption="Port Module">
        <register-group name="GROUP" name-in-module="GROUP" offset="0x00" size="0x80" count="1"/>
      </register-group>
      <value-group name="PORT_EVCTRL__EVACT0">
        <value name="OUT" caption="Event output to pin" value="0x0"/>
        <value name="SET" caption="Set output register of pin on event" value="0x1"/>
        <value name="CLR" caption="Clear output register of pin on event" value="0x2"/>
        <value name="TGL" caption="Toggle output register of pin on event" value="0x3"/>
      </value-group>
      <value-group name="PORT_PMUX__PMUXE">
        <value name="A" caption="Peripheral function A selected" value="0x0"/>
        <value name="B" caption="Peripheral function B selected" value="0x1"/>
        <value name="C" caption="Peripheral function C selected" value="0x2"/>
        <value name="D" caption="Peripheral function D selected" value="0x3"/>
        <value name="E" caption="Peripheral function E selected" value="0x4"/>
        <value name="F" caption="Peripheral function F selected" value="0x5"/>
        <value name="G" caption="Peripheral function G selected" value="0x6"/>
        <value name="H" caption="Peripheral function H selected" value="0x7"/>
        <value name="I" caption="Peripheral function I selected" value="0x8"/>
      </value-group>
      <value-group name="PORT_PMUX__PMUXO">
        <value name="A" caption="Peripheral function A selected" value="0x0"/>
        <value name="B" caption="Peripheral function B selected" value="0x1"/>
        <value name="C" caption="Peripheral function C selected" value="0x2"/>
        <value name="D" caption="Peripheral function D selected" value="0x3"/>
        <value name="E" caption="Peripheral function E selected" value="0x4"/>
        <value name="F" caption="Peripheral function F selected" value="0x5"/>
        <value name="G" caption="Peripheral function G selected" value="0x6"/>
        <value name="H" caption="Peripheral function H selected" value="0x7"/>
        <value name="I" caption="Peripheral function I selected" value="0x8"/>
      </value-group>
    </module>
    <module name="PTC" id="U2215" version="3.1.0" caption="Peripheral Touch Controller">
      <register-group name="PTC" caption="Peripheral Touch Controller"/>
    </module>
    <module name="RSTC" id="U2239" version="2.0.2" caption="Reset Controller">
      <register-group name="RSTC" caption="Reset Controller">
        <register name="RCAUSE" offset="0x0" rw="R" size="1" caption="Reset Cause">
          <bitfield name="POR" caption="Power On Reset" mask="0x1"/>
          <bitfield name="BODCORE" caption="Brown Out CORE Detector Reset" mask="0x2"/>
          <bitfield name="BODVDD" caption="Brown Out VDD Detector Reset" mask="0x4"/>
          <bitfield name="EXT" caption="External Reset" mask="0x10"/>
          <bitfield name="WDT" caption="Watchdog Reset" mask="0x20"/>
          <bitfield name="SYST" caption="System Reset Request" mask="0x40"/>
        </register>
      </register-group>
    </module>
    <module name="RTC" id="U2250" version="1.1.1" caption="Real-Time Counter">
      <register-group name="RTC" caption="Real-Time Counter">
        <mode name="MODE0" qualifier="RTC.MODE0.CTRLA.MODE" value="0" caption="32-bit Counter with Single 32-bit Compare"/>
        <mode name="MODE1" qualifier="RTC.MODE1.CTRLA.MODE" value="1" caption="16-bit Counter with Two 16-bit Compares"/>
        <mode name="MODE2" qualifier="RTC.MODE2.CTRLA.MODE" value="2" caption="Clock/Calendar with Alarm"/>
        <register modes="MODE0" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="MODE0 Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0xC" values="RTC_MODE0_CTRLA__MODE"/>
          <bitfield name="MATCHCLR" caption="Clear on Match" mask="0x80"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0xF00" values="RTC_MODE0_CTRLA__PRESCALER"/>
          <bitfield name="COUNTSYNC" caption="Count Read Synchronization Enable" mask="0x8000"/>
        </register>
        <register modes="MODE1" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="MODE1 Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0xC" values="RTC_MODE1_CTRLA__MODE"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0xF00" values="RTC_MODE1_CTRLA__PRESCALER"/>
          <bitfield name="COUNTSYNC" caption="Count Read Synchronization Enable" mask="0x8000"/>
        </register>
        <register modes="MODE2" name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="MODE2 Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0xC" values="RTC_MODE2_CTRLA__MODE"/>
          <bitfield name="CLKREP" caption="Clock Representation" mask="0x40"/>
          <bitfield name="MATCHCLR" caption="Clear on Match" mask="0x80"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0xF00" values="RTC_MODE2_CTRLA__PRESCALER"/>
          <bitfield name="CLOCKSYNC" caption="Clock Read Synchronization Enable" mask="0x8000"/>
        </register>
        <register modes="MODE0" name="EVCTRL" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="MODE0 Event Control">
          <bitfield name="PEREO0" caption="Periodic Interval 0 Event Output Enable" mask="0x1"/>
          <bitfield name="PEREO1" caption="Periodic Interval 1 Event Output Enable" mask="0x2"/>
          <bitfield name="PEREO2" caption="Periodic Interval 2 Event Output Enable" mask="0x4"/>
          <bitfield name="PEREO3" caption="Periodic Interval 3 Event Output Enable" mask="0x8"/>
          <bitfield name="PEREO4" caption="Periodic Interval 4 Event Output Enable" mask="0x10"/>
          <bitfield name="PEREO5" caption="Periodic Interval 5 Event Output Enable" mask="0x20"/>
          <bitfield name="PEREO6" caption="Periodic Interval 6 Event Output Enable" mask="0x40"/>
          <bitfield name="PEREO7" caption="Periodic Interval 7 Event Output Enable" mask="0x80"/>
          <bitfield name="CMPEO0" caption="Compare 0 Event Output Enable" mask="0x100"/>
          <bitfield name="OVFEO" caption="Overflow Event Output Enable" mask="0x8000"/>
        </register>
        <register modes="MODE1" name="EVCTRL" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="MODE1 Event Control">
          <bitfield name="PEREO0" caption="Periodic Interval 0 Event Output Enable" mask="0x1"/>
          <bitfield name="PEREO1" caption="Periodic Interval 1 Event Output Enable" mask="0x2"/>
          <bitfield name="PEREO2" caption="Periodic Interval 2 Event Output Enable" mask="0x4"/>
          <bitfield name="PEREO3" caption="Periodic Interval 3 Event Output Enable" mask="0x8"/>
          <bitfield name="PEREO4" caption="Periodic Interval 4 Event Output Enable" mask="0x10"/>
          <bitfield name="PEREO5" caption="Periodic Interval 5 Event Output Enable" mask="0x20"/>
          <bitfield name="PEREO6" caption="Periodic Interval 6 Event Output Enable" mask="0x40"/>
          <bitfield name="PEREO7" caption="Periodic Interval 7 Event Output Enable" mask="0x80"/>
          <bitfield name="CMPEO0" caption="Compare 0 Event Output Enable" mask="0x100"/>
          <bitfield name="CMPEO1" caption="Compare 1 Event Output Enable" mask="0x200"/>
          <bitfield name="OVFEO" caption="Overflow Event Output Enable" mask="0x8000"/>
        </register>
